{
  "architectures": [
    "Idefics3ForConditionalGeneration"
  ],
  "bos_token_id": 100264,
  "dtype": "bfloat16",
  "eos_token_id": 100257,
  "image_token_id": 100270,
  "model_type": "idefics3",
  "pad_token_id": 100257,
  "scale_factor": 4,
  "text_config": {
    "_name_or_path": "models/granitev06_hf_ai4k_sft_data_v4",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 100264,
    "dtype": "bfloat16",
    "eos_token_id": 100257,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 576,
    "initializer_range": 0.02,
    "intermediate_size": 1536,
    "max_position_embeddings": 8192,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 9,
    "num_hidden_layers": 30,
    "num_key_value_heads": 3,
    "pad_token_id": 100257,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 100000.0,
    "tie_word_embeddings": true,
    "use_cache": false,
    "vocab_size": 100352
  },
  "tie_word_embeddings": true,
  "transformers_version": "4.56.1",
  "use_cache": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_image_size": {
      "longest_edge": 512
    },
    "model_type": "idefics3_vision",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "size": {
      "longest_edge": 512
    }
  },
  "vocab_size": 100352
}
